In [9]:
import pandas as pd
import numpy as np
#changed the name of columns
data = pd.read_csv("..//raw//AAA_bond_yield.csv",header=None) #relative path represented as ..
data.columns=['Date3','AAA-Bond']
print(data.columns)

Index(['Date3', 'AAA-Bond'], dtype='object')

In [10]:
#removed the uncessary 0th index row
data=data.drop(index=[0])
data

            Date3 AAA-Bond
1      1983-01-03    11.77
2      1983-01-04    11.79
3      1983-01-05    11.79
4      1983-01-06    11.74
5      1983-01-07    11.74
...           ...      ...
10945  2024-12-13     5.23
10946  2024-12-16     5.21
10947  2024-12-17     5.19
10948  2024-12-18     5.26
10949  2024-12-19     5.37

[10949 rows x 2 columns]

In [11]:
data.describe() #just to check
#col=data.get('Date',None)
#data2= data[['AAA-Bond']].apply(pd.to_numeric, errors='coerce')
data

            Date3 AAA-Bond
1      1983-01-03    11.77
2      1983-01-04    11.79
3      1983-01-05    11.79
4      1983-01-06    11.74
5      1983-01-07    11.74
...           ...      ...
10945  2024-12-13     5.23
10946  2024-12-16     5.21
10947  2024-12-17     5.19
10948  2024-12-18     5.26
10949  2024-12-19     5.37

[10949 rows x 2 columns]

In [12]:
data['Date3'] = pd.to_datetime(data['Date3'], format='%Y-%m-%d',errors='coerce')
data['AAA-Bond']=pd.to_numeric(data['AAA-Bond'],errors='coerce') # since AAA-Bond was object type so converted to numeric data type
#above method checks for the format and then if there is any invalid marks as "Nat=not a time"
data=data.dropna(subset=['Date3'])  #drop rows with invalid data
data

           Date3  AAA-Bond
1     1983-01-03     11.77
2     1983-01-04     11.79
3     1983-01-05     11.79
4     1983-01-06     11.74
5     1983-01-07     11.74
...          ...       ...
10945 2024-12-13      5.23
10946 2024-12-16      5.21
10947 2024-12-17      5.19
10948 2024-12-18      5.26
10949 2024-12-19      5.37

[10949 rows x 2 columns]

In [13]:
# setting date column as index for resampling it for quaterly basis
data.set_index('Date3',inplace=True) #now setting date column back from index after getting quaterly values
quarterly=data.resample('ME').mean() #this gives the mean quarterly data
quarterly.reset_index(inplace=True)  #puts date name back to its place
print(quarterly) #data-converted to quarterly

         Date3   AAA-Bond
0   1983-01-31  11.788571
1   1983-02-28  12.007368
2   1983-03-31  11.732609
3   1983-04-30  11.513500
4   1983-05-31  11.463810
..         ...        ...
499 2024-08-31   4.866818
500 2024-09-30   4.683000
501 2024-10-31   4.950000
502 2024-11-30   5.136842
503 2024-12-31   5.105000

[504 rows x 2 columns]

In [14]:
quarterly.to_csv("AAA-Bond_quarterly.csv", index=False)

In [8]:
quarterly

         Date3   AAA-Bond
0   1983-03-31  11.834127
1   1983-06-30  11.577302
2   1983-09-30  12.350625
3   1983-12-31  12.410794
4   1984-03-31  12.293492
..         ...        ...
163 2023-12-31   5.219355
164 2024-03-31   4.965410
165 2024-06-30   5.223968
166 2024-09-30   4.895937
167 2024-12-31   5.054000

[168 rows x 2 columns]